In [95]:
%matplotlib inline
import pandas as pd
import numpy as np

In [3]:
titles = pd.read_csv('C:/Users/Dell/Downloads/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

How many movies are listed in the titles dataframe?

In [4]:
titles.count()

title    244914
year     244914
dtype: int64

What are the earliest two films listed in the titles dataframe?

In [5]:
earliest = titles.nsmallest(2,["year"])
earliest

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

How many movies have the title "Hamlet"?

In [6]:

movies =  titles[titles.title=="Hamlet"] 
movies

         title  year
6422    Hamlet  2017
10637   Hamlet  1921
39916   Hamlet  1913
52521   Hamlet  1910
62000   Hamlet  2000
67406   Hamlet  1969
82130   Hamlet  1987
88065   Hamlet  2016
101728  Hamlet  1948
122827  Hamlet  1973
133921  Hamlet  1976
154029  Hamlet  2015
161324  Hamlet  1964
172640  Hamlet  1954
173033  Hamlet  2011
178222  Hamlet  1996
189093  Hamlet  2009
192142  Hamlet  1990
198234  Hamlet  1911
202025  Hamlet  2014

How many movies are titled "North by Northwest"?

In [7]:
movies1 =  titles[titles.title=="North by Northwest"].count()
movies1

title    1
year     1
dtype: int64

When was the first movie titled "Hamlet" made?

In [8]:
d=movies.sort_values(by=['year'])
d.head(1)

        title  year
52521  Hamlet  1910

List all of the "Treasure Island" movies from earliest to most recent

In [9]:
movies2 =  titles[titles.title=="Treasure Island"].sort_values(by=['year'])
movies2

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

How many movies were made in the year 1950?

In [10]:
movies3 =  titles[titles.year==1950].count()
movies3

title    1113
year     1113
dtype: int64

How many movies were made in the year 1960?

In [11]:
movies4 =  titles[titles.year==1960].count()
movies4

title    1549
year     1549
dtype: int64

How many movies were made from 1950 through 1959?

In [12]:
len(titles[((titles['year'] >= 1950) & (titles['year'] < 1960))])

12934

In [13]:
cast = pd.read_csv('C:/Users/Dell/Downloads/cast.csv')
released = pd.read_csv('C:/Users/Dell/Downloads/release_dates.csv')

In what years has a movie titled "Batman" been released?

In [14]:
released1=released.drop_duplicates(subset=['title']) 
movies5 =  released1[released1.title=="Batman"]
movies5.year

39316    1943
Name: year, dtype: int64

How many roles were there in the movie "Inception"?

In [18]:
cast1=cast.dropna(subset=['n']) 
name1=cast1[cast1.title=="Inception"]
name1.n

149008     44.0
183937      8.0
260128     29.0
326745     11.0
333415     20.0
433867     26.0
444385     34.0
517227     30.0
590576      1.0
709436     23.0
737322     32.0
807795     45.0
812135     17.0
832083     40.0
833376     50.0
859993      2.0
910757     12.0
940923      4.0
967176     21.0
1170785    24.0
1309851    13.0
1455534    18.0
1615709     7.0
1618527    35.0
1668790    15.0
1701902    19.0
1812091    47.0
1826027    10.0
1861317    39.0
1876301     6.0
2049179    46.0
2250605    49.0
2267383    36.0
2406531     5.0
2614557    38.0
2765969     9.0
2776554    31.0
2807441    27.0
2932657    14.0
2932664    16.0
3151982    28.0
3158892    33.0
3203564    42.0
3225843    41.0
3343512    37.0
3359825    22.0
3387147     3.0
3444628    43.0
3473041    48.0
3480170    25.0
3731263    51.0
Name: n, dtype: float64

How many roles in the movie Inception are NOT ranked by an n value?

In [24]:
x=name1.n
print(len(x),"roles in the movie Inception are NOT ranked by an n value")

51  roles in the movie Inception are NOT ranked by an n value

But how many roles in the movie Inception did receive an n value?

In [26]:
name1=cast[cast.title=="Inception"]
name1['n'].isna().sum()

27

Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [28]:
name2=cast[cast.title=="North by Northwest"]
z=name2[name2.n.notnull()].sort_values(by=["n"])
z

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

Display the entire cast, in "n"-order, of the 1972 film "Sleuth"

In [45]:
name3= cast[(cast['title']=="North by Northwest") & (cast['year']==1972)]
y=name3.sort_values(by=["n"])
y

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth"

In [46]:
name3= cast[(cast['title']=="Sleuth") & (cast['year']==2007)]
y=name3.sort_values(by=["n"])
y

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

How many roles were credited in the silent 1921 version of Hamlet?

In [54]:
cast[(cast['title']=="Hamlet") & (cast['year']==1921)].character.shape[0]

9

How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [52]:
cast[(cast['title']=="Hamlet") & (cast['year']==1996)].character.shape[0]

54

How many "Hamlet" roles have been listed in all film credits through history?

In [56]:
cast[cast['title']=="Hamlet"].character.shape[0]

342

How many people have played an "Ophelia"?

In [57]:
cast[cast['character']=="Ophelia"].character.shape[0]

117

How many people have played a role called "The Dude"?

In [58]:
cast[cast['character']=="The Dude"].character.shape[0]

19

How many people have played a role called "The Stranger"?

In [59]:
cast[cast['character']=="The Stranger"].character.shape[0]

212

How many roles has Sidney Poitier played throughout his career?

In [60]:
cast[cast['name']=="Sidney Poitier"].character.shape[0]

43

How many roles has Judi Dench played?

In [61]:
cast[cast['name']=="Judi Dench"].character.shape[0]

55

List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [63]:
a=cast[(cast['name']=="Cary Grant") & (cast['year']==1940)]
x=a[a['n']=="2"].sort_values(by=["year"])
x

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

List the leading roles that Cary Grant played in the 1940s in order by year.

In [65]:
cast[(cast['name']=="Cary Grant") & (cast['year']==1940)].sort_values(by=["year"])

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

How many roles were available for actors in the 1950s?

In [73]:
c=cast[cast['year']==1950]
c.n.sum()

90719.0

How many leading roles (n=1) were available from the beginning of film history through 1980?

In [72]:
cast[(cast['n']==1) & (cast['year']>=1980)].character.shape[0]

89276

How many non-leading roles were available through from the beginning of film history through 1980?

In [75]:
cast[(cast['n']>=2) & (cast['year']>=1980)].character.shape[0]

1522873

How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [97]:
a=cast[cast['year']>=1980]
a['n'].np.na

AttributeError: 'Series' object has no attribute 'np'